# 1) Создать переменную типа String
stroka = str('Lessons_one')

print(stroka)

# 2) Создать переменную типа Integer
i = 3
print(i)

# 3) Создать переменную типа Float
f = 3.3
print(f)

# 4) Создать переменную типа Bytes
bi = b"Hello"
print(bi)

# 5) Создать переменную типа List
list_type = ['030119997', 'B-day', 'Jan03']
print(list_type)

# 6) Создать переменную типа Tuple
list_tuple = ('Jan', 'Capricon', '03011997')
print(list_tuple)

# 7) Создать переменную типа Set
set_type = {'Aliluzu', 'NickName'}
print(set_type)

# 8. Создать переменную типа Frozen set
frozeset_type = ({'banana', 'chocolate', 'banana cake'})
print(frozeset_type)

# 9) Создать переменную типа Dict
d = {'name': 'Alinka',
     'B-day': 'Jan03',
         'practise':{'courses1': 'Vadim_Ksendzov',
                 'practise2': 'Python'
                    }
     }
print(d)

# 10) Вывести в консоль все выше перечисленные переменные с добавлением типа данных.
print(type(stroka))

print(type(i))

print(type(f))

print(type(bi))

print(type(list_type))

print(type(list_tuple))

print(type(set_type))

print(type(frozeset_type))

print(type(d))

# 11) Создать 2 переменные String, создать переменную в которой сканкатенируете эти переменные. Вывести в консоль.
x = 'Milky'
y = 'Way'
z = x + y

print(z)

# 12) Вывести в одну строку переменные типа String и Integer используя “,” (Запятую)
a = 'Twix'
b = 2

print(a, b)
# 13) Вывести в одну строку переменные типа String и Integer используя “+” (Плюс)
Zemfira_ = 'Zemfira'
n = '3'
print ('Zemfira_'+ n)
